Documents/НачислениеЗаработнойПлатыСторнирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗаработнойПлатыСторнирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисленияСторнирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГрафика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновноеНачислениеСторнирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/ОсновныеНачисленияСторнирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисленияСторнирование</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновноеНачислениеСторнирование</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Documents/НачислениеЗаработнойПлатыСторнирование/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1. Установка маркера Записи у регистра
	Движения.ОсновныеНачисленияСторнирование.Записывать=Истина;
	// 2. Запрос, в котором заполняется коллекция движений по регистру
	Запрос = Новый Запрос;
    Запрос.Текст =
	  "ВЫБРАТЬ
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.Ссылка.ПериодРегистрации 		   КАК ПериодРегистрации,
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.Сотрудник 						   КАК Сотрудник,
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.ВидРасчета 					   КАК ВидРасчета,
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.Размер 						   КАК Размер,
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.ДатаНачала 					   КАК ПериодДействияНачало,
	 |	КОНЕЦПЕРИОДА(НачислениеЗаработнойПлатыСторнированиеНачисления.ДатаОкончания, ДЕНЬ) КАК ПериодДействияКонец,
	 |	ВЫБОР
	 |		КОГДА НачислениеЗаработнойПлатыСторнированиеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновноеНачислениеСторнирование.Больничный)
	 |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеЗаработнойПлатыСторнированиеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
	 |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	 |	КОНЕЦ 																			   КАК БазовыйПериодНачало,
	 |	ВЫБОР
	 |		КОГДА НачислениеЗаработнойПлатыСторнированиеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновноеНачислениеСторнирование.Больничный)
	 |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеЗаработнойПлатыСторнированиеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
	 |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	 |	КОНЕЦ 																			   КАК БазовыйПериодКонец
	 |ИЗ
	 |	Документ.НачислениеЗаработнойПлатыСторнирование.Начисления КАК НачислениеЗаработнойПлатыСторнированиеНачисления
	 |ГДЕ
	 |	НачислениеЗаработнойПлатыСторнированиеНачисления.Ссылка = &Ссылка"  ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	// 3. Заполнение коллекции движений по выборке результата запроса
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДвижений = Движения.ОсновныеНачисленияСторнирование.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, Выборка);
	КонецЦикла;
	// 4. Получение дополнительных данных, позволяющих выполнить сторнирование записей
    //с прошлым периодом регистрации при вводе текущего набора записей
	Дополнение = Движения.ОсновныеНачисленияСторнирование.ПолучитьДополнение();
	Для каждого Запись Из Дополнение Цикл
		// 5. Заполнение записи сторно
		Движение = Движения.ОсновныеНачисленияСторнирование.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,Запись);
        Движение.ПериодРегистрации = Запись.ПериодРегистрацииСторно;
        Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
        Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
        Движение.Сторно = Истина;
	КонецЦикла;
	// 6. Предварительная запись движений
	Движения.Записать(); 
    //7. Расчет записей регистра расчета
	РасчетЗП.РасчитатьСторнирование(Движения.ОсновныеНачисленияСторнирование,Ссылка);
КонецПроцедуры
